"""
Умова задачі:
Генерація числа:
     Програма випадковим чином обирає ціле число у заданому діапазоні (наприклад, від 1 до 100).
Кількість спроб:
     Гравцю надається обмежена кількість спроб (наприклад, 7), щоб вгадати це число.
Введення гравця:
     Користувач вводить свої здогадки через консоль.
Підказки:
     Після кожної спроби програма виводить підказку:
          Якщо введене число менше загаданого — повідомляється "Занадто маленьке".
          Якщо більше — "Занадто велике".
          Якщо вгадано точно — виводиться привітання з перемогою.
Завершення гри:
          Якщо користувач вичерпав усі спроби, програма виводить повідомлення про поразку і розкриває загаданe число.
"""